

kaithi_to_hindi = {
    "𑂃": "अ",
    "𑂄": "आ",
    "𑂅": "इ",
    "𑂆": "ई",
    "𑂇": "उ",
    "𑂈": "ऊ",
    "𑂉": "ए",
    "𑂊": "ऐ",
    "𑂋": "ओ",
    "𑂌": "औ",


    "𑂍": "क",
    "𑂎": "ख",
    "𑂏": "ग",
    "𑂐":"घ",
    "𑂑": "ङ",

    "𑂒":  "च",
    "𑂓":"छ",
    "𑂔":  "ज",
    "𑂕":"झ",
    "𑂖": "ञ",

    "𑂗": "ट",
    "𑂘":  "ठ",
    "𑂙": "ड",
    "𑂛": "ढ",
     "𑂝": "ण",

   "𑂞": "त",
    "𑂟": "थ",
    "𑂠": "द",
    "𑂡": "ध",
     "𑂢":"न",

     "𑂣":"प",
    "𑂤": "फ",
      "𑂥":"ब",
    "𑂦":"भ",
      "𑂧":"म",

    "𑂨":"य",
     "𑂩":"र",
    "𑂪":  "ल",
    "𑂫":"व",
    "𑂬": "श",
     "𑂭":"ष",
    "𑂮": "स",
     "𑂯": "ह",

}


def map_kaithi_to_hindi(kaithi_text: str) -> str:
    hindi_text = ""
    for char in kaithi_text:
        hindi_text += kaithi_to_hindi.get(char, char)
    return hindi_text
