"""
Kaithi to Hindi mapping
"""

kaithi_to_hindi = {
    "𑂃": "अ",
    "𑂄": "आ",
    "𑂅": "इ",
    "𑂆": "ई",
    "𑂇": "उ",
    "𑂈": "ऊ",
    "𑂉": "ऋ",
    "𑂊": "ए",
    "𑂋": "ऐ",
    "𑂌": "ओ",
    "𑂍": "औ",

    "𑂎": "क",
    "𑂏": "ख",
    "𑂐": "ग",
    "𑂑": "घ",
    "𑂒": "ङ",

    "𑂓": "च",
    "𑂔": "छ",
    "𑂕": "ज",
    "𑂖": "झ",
    "𑂗": "ञ",

    "𑂘": "ट",
    "𑂙": "ठ",
    "𑂚": "ड",
    "𑂛": "ढ",
    "𑂜": "ण",

    "𑂝": "त",
    "𑂞": "थ",
    "𑂟": "द",
    "𑂠": "ध",
    "𑂡": "न",

    "𑂢": "प",
    "𑂣": "फ",
    "𑂤": "ब",
    "𑂥": "भ",
    "𑂦": "म",

    "𑂧": "य",
    "𑂨": "र",
    "𑂩": "ल",
    "𑂪": "व",

    "𑂫": "श",
    "𑂬": "ष",
    "𑂭": "स",
    "𑂮": "ह",

    "𑂯": "ा",
    "𑂰": "ि",
    "𑂱": "ी",
    "𑂲": "ु",
    "𑂳": "ू",
    "𑂴": "ृ",
    "𑂵": "े",
    "𑂶": "ै",
    "𑂷": "ो",
    "𑂸": "ौ",

    "𑂹": "्",
    "𑂺": "ं",
    "𑂻": "ः",
    "𑂼": "ँ",

    "𑃐": "०",
    "𑃑": "१",
    "𑃒": "२",
    "𑃓": "३",
    "𑃔": "४",
    "𑃕": "५",
    "𑃖": "६",
    "𑃗": "७",
    "𑃘": "८",
    "𑃙": "९"
}


def map_kaithi_to_hindi(kaithi_text: str) -> str:
    hindi_text = ""
    for char in kaithi_text:
        hindi_text += kaithi_to_hindi.get(char, char)
    return hindi_text
